
# symbol_1 = '|'

# symbol_2 = ' '



# print(f"{' ':_<54}{' ':_>54}")

# print(f"{'|': <7}{'|': >7}{'|':>31}{'|':>29}{'|':>15}{'|':>19}")

# print(f"{'|': <6}id{'|': >6}"
#     f"{' ':>12}title{'|':>14}"
#     f"{' ':>11}autor{'|':>13}"
#     f"{' ':>5}year{'|':>6}"
#     f"{' ':>6}status{'|':>7}")

# print(f"{'|':_<7}{'|':_>7}{'|':_>31}{'|':_>29}{'|':_>15}{'|':_>19}")


# print(f'{symbol_1: <7}{symbol_1: >7}{symbol_1:>31}{symbol_1:>29}{symbol_1:>15}{symbol_1:>19}')


                        
# print('|{txt:^12}|'.format(txt='1')
#     + '{txt:^30}|'.format(txt='название книги')
#     + '{txt:*^28.26}|'.format(txt='автор книги автор')
#     + '{txt:^14}|'.format(txt='2000')
#     + '{txt:^18}|'.format(txt='в наличии'))




# print(f'{symbol_1:_<7}{symbol_1:_>7}{symbol_1:_>31}{symbol_1:_>29}{symbol_1:_>15}{symbol_1:_>19}')


# print((10 * '-') + (10 * '*') + (10 * '-'))
# print((5 * ' ') + 'Основное меню сервиса!\n')
# print((10 * '-') + (10 * '*') + (10 * '-') + '\n')



print(f"\n{'':-<10} {'':*>10} {'':->10}\n")
print(f"{'': <7} Основное меню {'': >7}\n")
print(f"{'':-<10} {'':*>10} {'':->10}\n")
